Teuskamerling/FMStwizy/blockset/rtw/STM32/src/STM32_E407/anin.c
/************************************************************************************//**
* \file         anin.c
* \brief        Analog inputs driver source file.
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*  Copyright 2019 (c)  by HAN Automotive   http://www.han.nl        All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* Permission is hereby granted, free of charge, to any person obtaining a copy of this 
* software and associated documentation files (the "Software"), to deal in the Software
* without restriction, including without limitation the rights to use, copy, modify, merge,
* publish, distribute, sublicense, and/or sell copies of the Software, and to permit
* persons to whom the Software is furnished to do so, subject to the following conditions:
*
* The above copyright notice and this permission notice shall be included in all copies or
* substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
* PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE
* FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
* OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
* DEALINGS IN THE SOFTWARE.
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "anin.h"                                     /* Analog input driver           */
#include "os.h"                                       /* for operating system          */
#include "errorcodes.h"                               /* for error codes               */
#include "errorList.h"                                /* for error list                */
#include "stm32f4xx.h"                                /* STM32 registers               */
#include "stm32f4xx_conf.h"                           /* STM32 peripheral drivers      */

/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief Flag to determine if the configuration was changed and requires updating. */
static uint8_t aninConfigurationChangedFlg = FALSE;

/** \brief Flag to determine is the driver was already initialized. */
static uint8_t aninInitialized = FALSE;

/** \brief Variable that holds the period time of ADCconversionTask in OS ticks. This allows
 **         a dynamic override through function ADCconversionTaskSetPeriod. */
static portTickType ADCconversionTaskPeriodTicks = (((portTickType)500*1000)/portTICK_PERIOD_US);

/** \brief Array for storing the analog to digital conversion results. */
static uint16_t aninConversionResults[ANIN_MAX_CHANNELS];

/** \brief Array to keep track of a channel's configuration. */
static tAninChannelCfgInfo aninChannelCfgInfo[ANIN_MAX_CHANNELS];

/** \brief Pointer to the beginning of the AninFilterStruct that holds the information
 * needed for filtering
 */
static AninFilterStruct *pointerToAninFilterData;

/****************************************************************************************
* Macro definitions
****************************************************************************************/


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static void    AninInit(void);
static void    AninReinit(void);
static uint8_t AninGetChannelIndex(uint8_t id);
static void    AninConvert(void);
static uint8_t AninGetNumConfiguredChannels(void);
static void    MedianFilter(uint16_t *NewSample, AninFilterStruct *PointerToFilterStruct);
static AninFilterStruct * AninGetPointerToFilterStruct(uint8_t pinid);
static void    InitializeFilterData(void);

/****************************************************************************************
* Constant data declarations
****************************************************************************************/
const static tAninPinMapping pinMapping[] =
{
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_3, ADC_Channel_9  }, /* 0:  ANIN_PORTF_PIN3  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_4, ADC_Channel_14 }, /* 1:  ANIN_PORTF_PIN4  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_5, ADC_Channel_15 }, /* 2:  ANIN_PORTF_PIN5  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_6, ADC_Channel_4  }, /* 3:  ANIN_PORTF_PIN6  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_7, ADC_Channel_5  }, /* 4:  ANIN_PORTF_PIN7  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_8, ADC_Channel_6  }, /* 5:  ANIN_PORTF_PIN8  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_9, ADC_Channel_7  }, /* 6:  ANIN_PORTF_PIN9  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_10, ADC_Channel_8 }, /* 7:  ANIN_PORTF_PIN10 */
  { RCC_AHB1Periph_GPIOC, GPIOC, GPIO_Pin_0, ADC_Channel_10 }, /* 8:  ANIN_PORTC_PIN0  */
  { RCC_AHB1Periph_GPIOC, GPIOC, GPIO_Pin_2, ADC_Channel_12 }  /* 9:  ANIN_PORTC_PIN2  */
};

/************************************************************************************//**
** \brief     Initializes the analog inputs driver.
** \return    none.
**
****************************************************************************************/
static void AninInit(void)
{
  ADC_CommonInitTypeDef ADC_CommonInitStructure;
  uint8_t idx;

  /* only do initialization once */
  if (aninInitialized == FALSE)
  {
    /* set flag */
    aninInitialized = TRUE;
    /* init arrays */
    for (idx=0; idx<ANIN_MAX_CHANNELS; idx++)
    {
      aninConversionResults[idx] = 0;
      aninChannelCfgInfo[idx].configuredFlg = FALSE;
	  aninChannelCfgInfo[idx].filterFlg = FALSE;
    }
    /* enable the DMA2 clock */
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
    /* enable the ADC3 clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC3, ENABLE);
    /* ADC common init */
    ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;
    ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
    ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
    ADC_CommonInit(&ADC_CommonInitStructure);
  }
} /*** end of AninInit ***/


/************************************************************************************//**
** \brief     Reinitializes the analog input driver for a different number of channels.
** \return    none.
**
****************************************************************************************/
static void AninReinit(void)
{
  ADC_InitTypeDef       ADC_InitStructure;
  DMA_InitTypeDef       DMA_InitStructure;
  uint8_t channelIdx;
  uint8_t numChannels;

  /* determine number of configured channels */
  numChannels = AninGetNumConfiguredChannels();
  /* DMA2 channel2 stream 0 configuration to store the ADC3 conversion results as a ring buffer */
  DMA_DeInit(DMA2_Stream0);
  DMA_InitStructure.DMA_Channel = DMA_Channel_2;
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&(ADC3->DR);
  DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)aninConversionResults;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
  DMA_InitStructure.DMA_BufferSize = numChannels;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
  DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
  DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
  DMA_Init(DMA2_Stream0, &DMA_InitStructure);
  DMA_Cmd(DMA2_Stream0, ENABLE);
  /* put everything back to power-on defaults */
  ADC_DeInit();
  /* configure 12-bit resolution */
  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  /* enable the scan conversion so we can convert multiple channels */
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  /* don't do continuous conversions - do them on demand */
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  /* start conversion by software, not an external trigger */
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T1_CC1;
  /* conversions are 12 bit - put them in the lower 12 bits of the result */
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  /* say how many channels would be used by the sequencer */
  ADC_InitStructure.ADC_NbrOfConversion = numChannels;
  /* now do the setup */
  ADC_Init(ADC3, &ADC_InitStructure);
  /* configure the channels */
  for (channelIdx=0; channelIdx<numChannels; channelIdx++)
  {
    ADC_RegularChannelConfig(ADC3, pinMapping[aninChannelCfgInfo[channelIdx].pinIdx].adcChannel,
                             channelIdx+1, ADC_SampleTime_56Cycles);
  }
  /* Turn off prefetch to reduce noise by accessing flash, see AN4073 */
  FLASH_PrefetchBufferCmd(DISABLE);
  /* Enable flash instruction & data cache, see AN4073 */
  FLASH_InstructionCacheCmd(ENABLE);
  FLASH_DataCacheCmd(ENABLE);
  /* Set ADCDC1 in the PWR_CR register, see option 1 in AN4073 */
  PWR->CR |= 0x2000; /*13th bit*/
  /* enable DMA request after last transfer */
  ADC_DMARequestAfterLastTransferCmd(ADC3, ENABLE);
  /* enable ADC3 DMA */
  ADC_DMACmd(ADC3, ENABLE);
  /* enable ADC3 */
  ADC_Cmd(ADC3, ENABLE);
} /*** end of AninReinit ***/


/************************************************************************************//**
** \brief     Finds the number of channels that are configured.
** \return    Number of configured channels.
**
****************************************************************************************/
static uint8_t AninGetNumConfiguredChannels(void)
{
  uint8_t count = 0;

