Teuskamerling/FMStwizy/blockset/rtw/STM32/src/STM32_E407/anin.c
  for (count=0; count<ANIN_MAX_CHANNELS; count++)
  {
    if (aninChannelCfgInfo[count].configuredFlg == FALSE)
    {
      break;
    }
  }
  return count;
} /*** end of AninGetNumConfiguredChannels ***/


/************************************************************************************//**
** \brief     Obtains the index into the aninChannelCfgInfo[] array of a specific pin.
** \param     id Pin identifier.
** \return    Index into the aninChannelCfgInfo[] array or ANIN_INVALID_CHANNEL_IDX if
**            not found.
**
****************************************************************************************/
static uint8_t AninGetChannelIndex(uint8_t id)
{
  uint8_t count;
  uint8_t channelIdx = ANIN_INVALID_CHANNEL_IDX;

  /* iterate through the array */
  for (count=0; count<ANIN_MAX_CHANNELS; count++)
  {
    /* is this the one we are looking for? */
    if ( (aninChannelCfgInfo[count].configuredFlg == TRUE) &&
         (aninChannelCfgInfo[count].pinIdx == id) )
    {
      /* store it and stop searching */
      channelIdx = count;
      break;
    }
  }
  /* return the results */
  return channelIdx;
} /*** end of AninGetChannelIndex ***/


/************************************************************************************//**
** \brief     Configures a analog input pin.
** \param     id Pin identifier, filtered indicate whether the result should be filtered
** \return    none.
**
****************************************************************************************/
void AninConfigure(uint8_t id, uint8_t filtered)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  uint8_t nextFreeChannelIdx;

  /* make sure the id is valid before using it as an array indexer */
  if (!(id < sizeof(pinMapping)/sizeof(pinMapping[0])))
  {
    ErrCodesSetError(ER_CODE_ANIN_INVALID_PIN, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }
  /* make sure the driver is initialized */
  AninInit();
  /* only continue if a configuration for this pin identifier wasn't already made */
  if (AninGetChannelIndex(id) == ANIN_INVALID_CHANNEL_IDX)
  {
    /* enable the port's peripheral clock */
    RCC_AHB1PeriphClockCmd(pinMapping[id].peripheral, ENABLE);
    /* prepare pin configuration */
    GPIO_InitStructure.GPIO_Pin = pinMapping[id].pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    /* initialize the pin */
    GPIO_Init(pinMapping[id].port, &GPIO_InitStructure);
    /* determine next free channel index */
    nextFreeChannelIdx = AninGetNumConfiguredChannels();
    /* make sure there is still a free spot in the results array */
    if (!(nextFreeChannelIdx < ANIN_MAX_CHANNELS))
    {
      ErrCodesSetError(ER_CODE_ANIN_NO_FREE_CHANNELS, ER_PARAM_SEVERITY_CRITICAL, TRUE);
    }
    /* store what pin identifier belongs to the newly configured channel */
    aninChannelCfgInfo[nextFreeChannelIdx].pinIdx = id;
    aninChannelCfgInfo[nextFreeChannelIdx].configuredFlg = TRUE;
	if(filtered > 0){
		aninChannelCfgInfo[nextFreeChannelIdx].filterFlg = TRUE;
	}
	
    /* request processing of the configuration change */
    aninConfigurationChangedFlg = TRUE;
  }
} /*** end of AninConfigure ***/


/************************************************************************************//**
** \brief     Obtains the conversion result of the analog input pin.
** \param     id Pin identifier, filtered indicate whether to return the filtered value
** \return    12-bit analog to digital conversion result.
**
****************************************************************************************/
uint16_t AninGet(uint8_t id, uint8_t filtered)
{
  uint8_t channelIdx;
  uint16_t result = 0;
  AninFilterStruct *pointerToFilterStruct = NULL;
  AninFilterStruct FilterStruct;

  /* make sure the id is valid before using it as an array indexer */
  if (!(id < sizeof(pinMapping)/sizeof(pinMapping[0])))
  {
    ErrCodesSetError(ER_CODE_ANIN_INVALID_PIN, ER_PARAM_SEVERITY_CRITICAL, TRUE);
  }

  /* if no analog inputs are configured, the driver is not initialized and nothing
   * needs to be done
   */
  if (aninInitialized == TRUE)
  {
	if(!filtered)
	{
		/* find the channel index that belongs to this pin identifier */
		channelIdx = AninGetChannelIndex(id);

		if (channelIdx != ANIN_INVALID_CHANNEL_IDX)
			{
			/* read from the results array where the conversion result was stored by the DMA */
			result = aninConversionResults[channelIdx];
			}
	} else {
		/* Check if the struct with filtered data exists by checking if the pointer exists */
		if(pointerToAninFilterData != NULL)
		{
			/* Search through memory area with ADC filter data for pinid == id */
			pointerToFilterStruct = AninGetPointerToFilterStruct(id); 
			if (pointerToFilterStruct != NULL)
			{
				/* read from the struct where the filter results were stored by the median filter */
				FilterStruct = *pointerToFilterStruct;
				/* Calculate the average and write to result */
				result = (uint16_t) (FilterStruct.FilterResult >> LOWPASSFILTERSHIFT);
			}
		} else {
			/* Set error because the pointer wasn't found */
			ErrCodesSetError(ER_CODE_ANIN_POINTER_NOT_FOUND, ER_PARAM_SEVERITY_CRITICAL, TRUE);
		}
	}
  }
  /* return the result */
  return result;
} /*** end of AninGet ***/


/************************************************************************************//**
** \brief     Starts an analog to digital conversion sequence for all configured
**            channels.
** \return    none.
**
****************************************************************************************/
static void AninConvert(void)
{
  /* if no analog inputs are configured, the driver is not initialized and nothing
   * needs to be done
   */
  if (aninInitialized == TRUE)
  {
    /* is a configuration change request pending? */
    if (aninConfigurationChangedFlg == TRUE)
    {
      /* reset flag */
      aninConfigurationChangedFlg = FALSE;
      /* re-initialize the driver for the new configuration */
      AninReinit();
    }
    /* start the conversion */
    ADC_SoftwareStartConv(ADC3);
  }
} /*** end of AninConvert ***/

/************************************************************************************//**
** \brief     Configures the period time of ADCfilterTask.
** \param     period Task period time in microseconds.
** \return    none.
**
****************************************************************************************/
void ADCconversionTaskSetPeriod(uint32_t period)
{
  ADCconversionTaskPeriodTicks = ((portTickType)period/portTICK_PERIOD_US);
} /*** end of ADCconversionTaskSetPeriod ***/



/************************************************************************************//**
** \brief     Task to automatically start conversion and filter the ADC results
** \param     *pvParameters (required by FREERTOS)
** \return    none.
** Ticket ref #71
****************************************************************************************/
void ADCconversionTask(void *pvParameters)
{
  /* Declare local variables */
  portTickType lastWakeTime;

  /* initialize to current time */
  lastWakeTime = xTaskGetTickCount();

  /* enter task body */
  for( ;; )
  {
	/*Start conversion of ADC's (and filtering) */
	ADCconversionTaskFunction();
	/* activate this task periodically, run ten times faster than application */
    vTaskDelayUntil(&lastWakeTime, ADCconversionTaskPeriodTicks);
  } /* End of task body */
  
} /*** End of ADCconversionTask ***/

/************************************************************************************//**
** \brief     Function to start conversion and filter the ADC results
** \param     none
** \return    none.
** Ticket ref #71
****************************************************************************************/
void ADCconversionTaskFunction(void)
{
	/* Declare local variables */
	uint8_t i, j;
	AninFilterStruct tempFilterStruct;
	uint8_t channelIdx;
	
	/* Start the analog conversions */
	AninConvert();
	/* Only filter result if channels need to be filtered */
	if(nrFilteredADCchannels > 0)
	{
		/* Allocate and initialize the data in the memory if this has not been done yet*/
		if(pointerToAninFilterData == NULL)
		{
			InitializeFilterData(); 
		}
		/* Loop through all channels */
		for(i=0;i<ANIN_MAX_CHANNELS;i++)
		{
			/* Look for channels that need filtering */
			if(aninChannelCfgInfo[i].filterFlg && aninChannelCfgInfo[i].configuredFlg)
			{
				for(j=0;j<nrFilteredADCchannels;j++)
				{
					tempFilterStruct = *(pointerToAninFilterData + j);
					if(tempFilterStruct.pinId == aninChannelCfgInfo[i].pinIdx)
					{
						/*Find the index in the conversion result array*/
						channelIdx = AninGetChannelIndex(aninChannelCfgInfo[i].pinIdx);
						/*Call the MedianFilter */
						MedianFilter(&aninConversionResults[channelIdx],(pointerToAninFilterData + j));
						//break;? no need to continue in the for loop //TODO Jason
					}
				}
			}
		} /* end of for loop */
	}
} /*** end of ADCfilterTaskFunction ***/

/************************************************************************************//**
** \brief     Initializes the data for analog filtering
** \param     none.
** \return    none.
**
****************************************************************************************/
static void InitializeFilterData(void)
{
	AninFilterStruct tempFilterStruct;
	AninFilterStruct *pointerToStructToFill;
	uint8_t i;
	uint8_t InitIndex;
		
