Teuskamerling/FMStwizy/blockset/rtw/STM32/src/STM32_E407/anin.c
	/* Allocate memory for the structs */
	pointerToAninFilterData = pvPortMalloc(sizeof(AninFilterStruct)*(uint16_t)nrFilteredADCchannels);
	/* Set error if the memory couldn't be allocated */
	if(pointerToAninFilterData == NULL)
	{
		ErrCodesSetError(ER_CODE_ANIN_ALLOC_ERROR, ER_PARAM_SEVERITY_CRITICAL, TRUE);
	} else {
		/* Put pin id's in the struct */
		/* Point to the first struct in the memory area */
		pointerToStructToFill = pointerToAninFilterData;
		/* Loop through all configured analog inputs and find the ones with filtering */
		for(i=0;i<ANIN_MAX_CHANNELS;i++)
		{
			if(aninChannelCfgInfo[i].filterFlg > 0)
			{
				tempFilterStruct.pinId = aninChannelCfgInfo[i].pinIdx;
				/* Set all sample data to zero and add the sample age */
				for( InitIndex = 0; InitIndex < FILTERSIZE; InitIndex++ )
				{
					tempFilterStruct.Samples[InitIndex]  = InitIndex << 27;
				}
				/* Set the filter result to zero */
				tempFilterStruct.FilterResult = 33;
				/* Write data to the memory */
				*pointerToStructToFill = tempFilterStruct;
				/* Move pointer to the next struct */
				pointerToStructToFill++;
				/* Check if the pointer isn't exceeding the memory allocated for analog filtering */
				if ((uint32_t)pointerToStructToFill > (uint32_t)(pointerToAninFilterData + nrFilteredADCchannels))
				{
					ErrCodesSetError(ER_CODE_ANIN_POINTER_OUT_RANGE, ER_PARAM_SEVERITY_CRITICAL, TRUE);
					vPortFree(pointerToAninFilterData);
					break; /* Stop the for loop to make sure no memory is overwritten */
				}
			}
		} /* end of for loop */
	}
} /*** end of InitializeFilterData ***/

/************************************************************************************//**
** \brief     Returns a pointer to the struct matching the pin id
** \param     pinid, pin identifier to be found.
** \return    pointer to struct.
**
****************************************************************************************/
static AninFilterStruct * AninGetPointerToFilterStruct(uint8_t pinId)
{
	/* Declare variables */
	uint8_t j;
	AninFilterStruct *pointerToFilterStruct;
	AninFilterStruct tempFilterStruct;

	/* Check if global pointer is NULL (set error if it is) */
	if(pointerToAninFilterData != NULL)
	{
		/* Loop through structs and stop when pin id is found */
		for(j=0;j<nrFilteredADCchannels;j++)
		{
			tempFilterStruct = *(pointerToAninFilterData+j);
			if(pinId == tempFilterStruct.pinId)
			{
				pointerToFilterStruct = (pointerToAninFilterData+j);
				return pointerToFilterStruct;
				//break; also possible, to avoid 2 return paths (MISRA-C compliance)
			}
		}
	} else {
		ErrCodesSetError(ER_CODE_ANIN_INVALID_POINTER, ER_PARAM_SEVERITY_CRITICAL, TRUE);
	}
	return pointerToFilterStruct;
} /*** end of AninGetPointerToFilterStruct() ***/



/************************************************************************************//**
** \brief     Using a special median filter to filter ADC samples. Originally designed
			  by Ton Fleuren.
** \param     pointer to NewSample, pointer to FilterOuput (this could be made a return
			  values aswell.
** \return    none.
** Ticket ref #71
****************************************************************************************/
static void MedianFilter(uint16_t *NewSample, AninFilterStruct *PointerToFilterStruct)
{
	/* Declare local variables */
	AninFilterStruct FilterData;
	uint32_t IntNewSample;
	uint8_t Index = 0;
	uint8_t NewSampleIndex = 0;
	
  /* Copy the data from the memory to the local variable */
  FilterData = *PointerToFilterStruct;
  
   //find the element to be removed; top 5 bits equal SampleAgeIndex
   //if the array is properly initialised and maintained, a sample should always be found without overrunning the array!
  while( ( FilterData.Samples[Index] & 0xF8000000 ) != ( FilterData.SampleAgeIndex << 27 ) )
    Index++;

   //if the sample to be removed lays before the end of the FIR filter window
  if( Index < ( ( FILTERSIZE - LOWPASSFILTERSIZE ) / 2 + LOWPASSFILTERSIZE ) )
  { 
    // add the value that is going to be shifted into the window
    FilterData.FilterResult += FilterData.Samples[( FILTERSIZE - LOWPASSFILTERSIZE ) / 2 + LOWPASSFILTERSIZE] & 0x07FFFFFF;
    
    if( Index >= ( FILTERSIZE - LOWPASSFILTERSIZE ) / 2 ) // sample is within FIR filter window
 	  FilterData.FilterResult -= FilterData.Samples[Index] & 0x07FFFFFF; // subtract removed sample
    else // sample is below the FIR filter window
      // subtract sample that is going to be shifted out of window  
      FilterData.FilterResult -= FilterData.Samples[( FILTERSIZE - LOWPASSFILTERSIZE ) / 2] & 0x07FFFFFF;
  }
  
  // remove the old sample by shifting samples after it down
  while( Index++ < FILTERSIZE - 1 )
      FilterData.Samples[Index - 1] = FilterData.Samples[ Index ];
  
  // insert sample with maximum value to prevent buffer overrun if the
  // new sample is larger than all existing samples
  FilterData.Samples[FILTERSIZE - 1] = 0x07FFFFFF;
  
  // limit NewSample to 12 bits
  IntNewSample = *NewSample & 0x0FFF;

  // find place to insert new sample. this could be improved by using a binary search algorithm
  while( ( FilterData.Samples[NewSampleIndex] & 0x07FFFFFF ) < IntNewSample )
    NewSampleIndex++;
  
  if( NewSampleIndex < ( FILTERSIZE - LOWPASSFILTERSIZE ) / 2 + LOWPASSFILTERSIZE )
  { // new sample will be inserted within or before the FIR filter window
    // subtract sample that is going to be shifted out of the window
    FilterData.FilterResult -= FilterData.Samples[( FILTERSIZE - LOWPASSFILTERSIZE ) / 2 + LOWPASSFILTERSIZE - 1] & 0x07FFFFFF;
    
    if( NewSampleIndex >= ( FILTERSIZE - LOWPASSFILTERSIZE ) / 2 ) // sample is within FIR filter window
      FilterData.FilterResult += IntNewSample; // add inserted sample
    else
      // add sample that is going to be shifted into window
      FilterData.FilterResult += FilterData.Samples[( FILTERSIZE - LOWPASSFILTERSIZE ) / 2 - 1] & 0x07FFFFFF;
  }
  
  // shift samples from insertion index up (backwards is easier)
  Index = FILTERSIZE - 1;
  while( Index-- > NewSampleIndex )
    FilterData.Samples[Index + 1] = FilterData.Samples[Index];
    
  // insert new sample
  FilterData.Samples[NewSampleIndex] = IntNewSample | ( FilterData.SampleAgeIndex << 27 );
    
  if( ++FilterData.SampleAgeIndex >= FILTERSIZE )
    FilterData.SampleAgeIndex = 0;
    
  /* Copy data back to the memory block */
  *PointerToFilterStruct = FilterData;
} /*** End of MedianFilter ***/

/************************************ end of anin.c ************************************/


